; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=99, out_folder=htg/blocksworld/training, instance_id=79, seed=2103, goal_proportion=0.1

(define (problem blocksworld-79)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 - object)
 (:init 
    (arm-empty)
    (clear b99)
    (on b99 b38)
    (on b38 b47)
    (on b47 b48)
    (on b48 b50)
    (on b50 b41)
    (on b41 b95)
    (on-table b95)
    (clear b51)
    (on-table b51)
    (clear b63)
    (on b63 b15)
    (on b15 b28)
    (on-table b28)
    (clear b90)
    (on b90 b79)
    (on-table b79)
    (clear b29)
    (on b29 b96)
    (on b96 b80)
    (on-table b80)
    (clear b36)
    (on b36 b45)
    (on-table b45)
    (clear b3)
    (on b3 b22)
    (on b22 b73)
    (on-table b73)
    (clear b14)
    (on-table b14)
    (clear b57)
    (on-table b57)
    (clear b13)
    (on-table b13)
    (clear b85)
    (on b85 b97)
    (on b97 b58)
    (on b58 b83)
    (on-table b83)
    (clear b24)
    (on-table b24)
    (clear b12)
    (on b12 b10)
    (on b10 b44)
    (on-table b44)
    (clear b72)
    (on b72 b46)
    (on b46 b61)
    (on b61 b30)
    (on-table b30)
    (clear b19)
    (on-table b19)
    (clear b59)
    (on b59 b26)
    (on-table b26)
    (clear b92)
    (on-table b92)
    (clear b98)
    (on b98 b54)
    (on-table b54)
    (clear b6)
    (on b6 b75)
    (on b75 b21)
    (on b21 b68)
    (on b68 b71)
    (on b71 b78)
    (on b78 b27)
    (on b27 b39)
    (on-table b39)
    (clear b4)
    (on-table b4)
    (clear b87)
    (on-table b87)
    (clear b69)
    (on-table b69)
    (clear b37)
    (on b37 b31)
    (on b31 b23)
    (on-table b23)
    (clear b33)
    (on b33 b18)
    (on b18 b49)
    (on-table b49)
    (clear b35)
    (on b35 b5)
    (on b5 b82)
    (on b82 b42)
    (on b42 b89)
    (on b89 b94)
    (on-table b94)
    (clear b67)
    (on b67 b84)
    (on b84 b25)
    (on b25 b76)
    (on b76 b55)
    (on b55 b74)
    (on-table b74)
    (clear b20)
    (on-table b20)
    (clear b70)
    (on b70 b65)
    (on b65 b40)
    (on b40 b52)
    (on b52 b62)
    (on b62 b60)
    (on b60 b16)
    (on-table b16)
    (clear b2)
    (on b2 b1)
    (on b1 b17)
    (on b17 b32)
    (on b32 b81)
    (on b81 b86)
    (on-table b86)
    (clear b64)
    (on b64 b9)
    (on b9 b91)
    (on b91 b56)
    (on-table b56)
    (clear b34)
    (on b34 b77)
    (on b77 b7)
    (on b7 b53)
    (on b53 b93)
    (on b93 b88)
    (on-table b88)
    (clear b8)
    (on b8 b43)
    (on-table b43)
    (clear b66)
    (on b66 b11)
    (on-table b11))
 (:goal  (and 
    (clear b3)
    (on b3 b5)
    (on-table b5)
    (clear b8)
    (on b8 b6)
    (on b6 b2)
    (on b2 b7)
    (on b7 b1)
    (on b1 b4)
    (on-table b4)
    (clear b9)
    (on-table b9))))

; plan
1. (unstack b64 b9)
   deleted: (on b64 b9) (clear b64) (arm-empty)
   added: (holding b64) (clear b9)
   goals met: 4 of 12
2. (putdown b64)
   deleted: (holding b64)
   added: (clear b64) (arm-empty) (on-table b64)
   goals met: 4 of 12
3. (unstack b9 b91)
   deleted: (on b9 b91) (clear b9) (arm-empty)
   added: (holding b9) (clear b91)
   goals met: 3 of 12
4. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 5 of 12
5. (unstack b8 b43)
   deleted: (on b8 b43) (clear b8) (arm-empty)
   added: (holding b8) (clear b43)
   goals met: 4 of 12
6. (stack b8 b6)
   deleted: (clear b6) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b6)
   goals met: 6 of 12
7. (unstack b35 b5)
   deleted: (on b35 b5) (clear b35) (arm-empty)
   added: (holding b35) (clear b5)
   goals met: 6 of 12
8. (putdown b35)
   deleted: (holding b35)
   added: (clear b35) (arm-empty) (on-table b35)
   goals met: 6 of 12
9. (unstack b3 b22)
   deleted: (on b3 b22) (clear b3) (arm-empty)
   added: (holding b3) (clear b22)
   goals met: 5 of 12
10. (stack b3 b5)
   deleted: (clear b5) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b5)
   goals met: 7 of 12
11. (unstack b2 b1)
   deleted: (on b2 b1) (clear b2) (arm-empty)
   added: (holding b2) (clear b1)
   goals met: 7 of 12
12. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 7 of 12
13. (unstack b1 b17)
   deleted: (on b1 b17) (clear b1) (arm-empty)
   added: (holding b1) (clear b17)
   goals met: 7 of 12
14. (stack b1 b4)
   deleted: (clear b4) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b4)
   goals met: 8 of 12
15. (unstack b34 b77)
   deleted: (on b34 b77) (clear b34) (arm-empty)
   added: (holding b34) (clear b77)
   goals met: 8 of 12
16. (putdown b34)
   deleted: (holding b34)
   added: (clear b34) (arm-empty) (on-table b34)
   goals met: 8 of 12
17. (unstack b77 b7)
   deleted: (on b77 b7) (clear b77) (arm-empty)
   added: (holding b77) (clear b7)
   goals met: 8 of 12
18. (putdown b77)
   deleted: (holding b77)
   added: (clear b77) (arm-empty) (on-table b77)
   goals met: 8 of 12
19. (unstack b7 b53)
   deleted: (on b7 b53) (clear b7) (arm-empty)
   added: (holding b7) (clear b53)
   goals met: 8 of 12
20. (stack b7 b1)
   deleted: (clear b1) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b1)
   goals met: 9 of 12
21. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 9 of 12
22. (stack b2 b7)
   deleted: (clear b7) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b7)
   goals met: 10 of 12
23. (unstack b8 b6)
   deleted: (on b8 b6) (clear b8) (arm-empty)
   added: (holding b8) (clear b6)
   goals met: 8 of 12
24. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 9 of 12
25. (unstack b6 b75)
   deleted: (on b6 b75) (clear b6) (arm-empty)
   added: (holding b6) (clear b75)
   goals met: 9 of 12
26. (stack b6 b2)
   deleted: (clear b2) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b2)
   goals met: 10 of 12
27. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 9 of 12
28. (stack b8 b6)
   deleted: (clear b6) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b6)
   goals met: 11 of 12
29. (unstack b3 b5)
   deleted: (on b3 b5) (clear b3) (arm-empty)
   added: (holding b3) (clear b5)
   goals met: 9 of 12
30. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 10 of 12
31. (unstack b5 b82)
   deleted: (on b5 b82) (clear b5) (arm-empty)
   added: (holding b5) (clear b82)
   goals met: 10 of 12
32. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 11 of 12
33. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 10 of 12
34. (stack b3 b5)
   deleted: (clear b5) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b5)
   goals met: 12 of 12
